DELETE
FROM LUNCHES;
DELETE
FROM RESTAURANTS;
DELETE
FROM USER_ROLES;
DELETE
FROM USERS;
DELETE
FROM VOTES;

ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO USER_ROLES (ROLE)
VALUES ('USER'),
       ('ADMIN');

INSERT INTO USERS (NAME, SURNAME, EMAIL, PASSWORD)
VALUES ('Azat', 'Burkhanov', 'azburhanov@mail.ru', 'password'),
       ('Vadim', 'Demchenko', 'demo@gmail.com', 'qwerty'),
       ('Petr', 'Petrov', 'petrov_petr@mail.ru', 'qwerty123'),
       ('Elena', 'Barinova', 'lena_barinova@gmail.com', '123qwerty');

-- list of restaurants
INSERT INTO RESTAURANTS (RESTAURANT_NAME)
VALUES ('AnderSon'),
       ('Russian Pub'),
       ('Italoniya'),
       ('Piccochino'),
       ('Bardak'),
       ('Khachapuri');

-- linches
INSERT INTO LUNCHES (DATE_REGISTERED, RESTAURANT_ID, LUNCH_NAME, PRICE)
VALUES ('2021-01-01 10:00:00', 100006, 'Стейк лосося с ризотто из булгура и томатами', 710),
       ('2021-01-01 10:00:00', 100006, 'Том Ям с креветками на кокосовом молоке', 410),
       ('2021-01-01 10:00:00', 100006, 'Брускетта со слабосоленым лососем и сливочным сыром', 520),
       ('2021-01-01 10:00:00', 100006,
        'Горячий сэндвич с индейкой, сыром моцарелла, вялеными томатами и домашней заправкой цезарь на листьях салата романо',
        360),
       ('2021-01-01 10:00:00', 100006,
        'Фирменные сырники от АндерСон из свежего творога с протертой малиной и сметаной', 370),
       ('2021-01-01 10:00:00', 100007, 'Пай по-строгановски', 730),
       ('2021-01-01 10:00:00', 100007, 'Куриные крылья', 480),
       ('2021-01-01 10:00:00', 100007, 'Бургер со щукой', 450),
       ('2021-01-01 10:00:00', 100007, 'Бургер с пастрами и белыми груздями', 590),
       ('2021-01-01 10:00:00', 100008, 'Тартирно с хурмой', 420),
       ('2021-01-01 10:00:00', 100008, 'Шоколадный торт', 350),
       ('2021-01-01 10:00:00', 100008, 'Фарфале с лососем и икрой', 640),
       ('2021-01-01 10:00:00', 100009, 'ФИРМЕННАЯ ПИЦЦА С КОЛБАСКАМИ В БОРТИКЕ', 650),
       ('2021-01-01 10:00:00', 100009, 'ПИЦЦА ПАРМА РУККОЛА', 670),
       ('2021-01-01 10:00:00', 100010, 'Гриль сет Izgara 1000 гр', 1600),
       ('2021-01-01 10:00:00', 100010, 'Дана тантуни Dana tantuni 210 гр', 480),
       ('2021-01-01 10:00:00', 100010, 'Креветки Кадаиф Kadayifli karides 150 гр', 480),
       ('2021-01-01 10:00:00', 100011, 'Хачапури на шампуре', 260),
       ('2021-01-01 10:00:00', 100011, 'Суп харчо из говядины', 380),
       ('2021-01-01 10:00:00', 100011, 'Баранья корейка с красной аджикой', 1290);

INSERT INTO VOTES (USER_ID, VOTE_DATE, RESTAURANT_ID)
VALUES (100002, '2021-01-02 10:00:00', 100010),
       (100003, '2021-01-02 15:00:00', 100009),
       (100004, '2021-01-02 11:00:00', 100011),
       (100005, '2021-01-02 09:00:00', 100009);

